
class View:

    def viewMenu(journal_list):
        print('-------------------------------------------------------------------------')
        print('                              ГЛАВНОЕ МЕНЮ')
        print('-------------------------------------------------------------------------')
        print('       Чтобы открыть журнал или создать новый введите номер класса       ')
        print('              Для выхода из программы введите "0"')
        print('-------------------------------------------------------------------------')
        print('                            Доступные журналы:')
        if journal_list:
            print(*journal_list)
        else:
            print('                          Доступных журналов нет')
        print('-------------------------------------------------------------------------')
        return input('                                ')


    def journalMenu(name):
        print('-------------------------------------------------------------------------')
        print(f'                          ЖУРНАЛ "{name.upper()}" КЛАССА')
        print('-------------------------------------------------------------------------')
        print('        Чтобы посмотреть успеваемость ученика введите "1-имя ученика"')
        print(' Чтобы открыть предмет или содать новую запись введите "2-название предмета" ')
        print('              Для выхода в ГЛАВНОЕ МЕНЮ введите любой символ')
        print('-------------------------------------------------------------------------')
        return input('                             ')


    def newJournalMenu(name):
        print('-------------------------------------------------------------------------')
        print(f'                      ЖУРНАЛ "{name.upper()}" НЕ СУЩЕСТВУЕТ')
        print('-------------------------------------------------------------------------')
        print(f'              Чтобы создать журнал с именем "{name.upper()}" введите "1"')
        print('              Для выхода в ГЛАВНОЕ МЕНЮ введите любой символ')
        print('-------------------------------------------------------------------------')
        return input('                                ')

    def view_student(name, data):
        if data:
            print('-------------------------------------------------------------------------')
            print(f'                                 {name}')
            print('-------------------------------------------------------------------------')
            for item in data:
                if name == item.student:
                    print(item.subject, *item.data)
        else:
            print('-------------------------------------------------------------------------')
            print('                             Журнал пуст')
            print('-------------------------------------------------------------------------')
        
    def view_subject(name, data):
        if data:
            print('-------------------------------------------------------------------------')
            print(f'                                 {name}')
            print('-------------------------------------------------------------------------')
            for item in data:
                if name == item.subject:
                    print(item.student, *item.data) 
        else:
            print('-------------------------------------------------------------------------')
            print('                             Журнал пуст')
            print('-------------------------------------------------------------------------')
        print('-------------------------------------------------------------------------')
        print('            Чтобы вписать ученика в предмет введите имя ученика')
        print('         Чтобы удалить ученика из предмета введите "имя ученика-0"')
        print('        Чтобы поставить ученику оценку введите "имя ученика-оценка"')
        print('              Для выхода в МЕНЮ журнала введите любой символ')
        print('-------------------------------------------------------------------------')
        return input('                             ')


